scripts/ssd-prefetch-ttft-ab/evidence/final-round/0327ddcb-a2-142/results/b_r2.bench.log
INFO 09-21 13:28:26 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 09-21 13:28:26 [__init__.py:46] - ascend -> vllm_ascend:register
INFO 09-21 13:28:26 [__init__.py:49] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO 09-21 13:28:26 [__init__.py:238] Platform plugin ascend is activated
INFO 09-21 13:28:26 [platform.py:62] Breakable cudagraph is force disabled on Ascend because DeepSeek V4 PIECEWISE cudagraph is not supported yet.
2026-09-21 13:28:36,430 - 54246 - ServiceProfiler - INFO - VLLM_USE_V1 not set, auto-detected via vLLM 0.23.0+empty: default 1
INFO 09-21 13:28:37 [__init__.py:115] Registered model loader `<class 'vllm_ascend.model_loader.netloader.netloader.ModelNetLoaderElastic'>` with load format `netloader`
INFO 09-21 13:28:37 [__init__.py:115] Registered model loader `<class 'vllm_ascend.model_loader.rfork.rfork_loader.RForkModelLoader'>` with load format `rfork`
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xffff10d1ec00>, trust_remote_code=True, seed=42, num_prompts=48, dataset_name='custom', no_stream=False, dataset_path='/home/<user>/prefetch_916/920_pre_pr/perf/data/prompts.jsonl', no_oversample=False, skip_chat_template=True, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=8, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:8271', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=4, model='dsv4-flash', input_len=None, output_len=None, tokenizer='/home/<user>/DeepSeek-V4-Flash-w8a8-mtp/DeepSeek-V4-Flash-w8a8-mtp', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/home/<user>/prefetch_916/920_pre_pr/ttft-ab/results', result_filename='b_r2.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-23f28ae8-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
`rope_parameters`'s factor field must be a float >= 1, got 16
`rope_parameters`'s beta_fast field must be a float, got 32
`rope_parameters`'s beta_slow field must be a float, got 1
`rope_parameters`'s factor field must be a float >= 1, got 16
`rope_parameters`'s beta_fast field must be a float, got 32
`rope_parameters`'s beta_slow field must be a float, got 1
`rope_parameters`'s factor field must be a float >= 1, got 16
`rope_parameters`'s beta_fast field must be a float, got 32
`rope_parameters`'s beta_slow field must be a float, got 1
`rope_parameters`'s factor field must be a float >= 1, got 16
`rope_parameters`'s beta_fast field must be a float, got 32
`rope_parameters`'s beta_slow field must be a float, got 1
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4

  0%|          | 0/48 [00:00<?, ?it/s]
  2%|▏         | 1/48 [00:10<08:14, 10.53s/it]
  4%|▍         | 2/48 [00:10<03:28,  4.54s/it]
  6%|▋         | 3/48 [00:11<01:58,  2.63s/it]
  8%|▊         | 4/48 [00:13<01:48,  2.46s/it]
 10%|█         | 5/48 [00:21<03:08,  4.39s/it]
 12%|█▎        | 6/48 [00:21<02:06,  3.02s/it]
 15%|█▍        | 7/48 [00:21<01:28,  2.16s/it]
 17%|█▋        | 8/48 [00:24<01:26,  2.17s/it]
 19%|█▉        | 9/48 [00:32<02:33,  3.94s/it]
 21%|██        | 10/48 [00:32<01:47,  2.83s/it]
 23%|██▎       | 11/48 [00:32<01:16,  2.08s/it]
 25%|██▌       | 12/48 [00:34<01:16,  2.11s/it]
 27%|██▋       | 13/48 [00:42<02:14,  3.84s/it]
 29%|██▉       | 14/48 [00:43<01:34,  2.78s/it]
 31%|███▏      | 15/48 [00:43<01:07,  2.06s/it]
 33%|███▎      | 16/48 [00:45<01:06,  2.08s/it]
 35%|███▌      | 17/48 [00:53<01:57,  3.80s/it]
 38%|███▊      | 18/48 [00:53<01:22,  2.76s/it]
 40%|███▉      | 19/48 [00:54<00:59,  2.05s/it]
 42%|████▏     | 20/48 [00:56<00:58,  2.10s/it]
 44%|████▍     | 21/48 [01:04<01:42,  3.81s/it]
 46%|████▌     | 22/48 [01:04<01:11,  2.77s/it]
 48%|████▊     | 23/48 [01:04<00:51,  2.06s/it]
 50%|█████     | 24/48 [01:07<00:50,  2.10s/it]
 52%|█████▏    | 25/48 [01:13<01:18,  3.41s/it]
 54%|█████▍    | 26/48 [01:16<01:13,  3.35s/it]
 56%|█████▋    | 27/48 [01:17<00:51,  2.44s/it]
 58%|█████▊    | 28/48 [01:17<00:36,  1.83s/it]
 60%|██████    | 29/48 [01:24<01:03,  3.32s/it]
 62%|██████▎   | 30/48 [01:27<00:57,  3.18s/it]
 65%|██████▍   | 31/48 [01:27<00:39,  2.33s/it]
 67%|██████▋   | 32/48 [01:27<00:28,  1.75s/it]
 69%|██████▉   | 33/48 [01:30<00:28,  1.89s/it]
 71%|███████   | 34/48 [01:34<00:36,  2.61s/it]
 73%|███████▎  | 35/48 [01:39<00:44,  3.42s/it]
 75%|███████▌  | 36/48 [01:40<00:29,  2.50s/it]
 77%|███████▋  | 37/48 [01:42<00:27,  2.52s/it]
 79%|███████▉  | 38/48 [01:45<00:25,  2.51s/it]
 81%|████████▏ | 39/48 [01:50<00:30,  3.35s/it]
 83%|████████▎ | 40/48 [01:50<00:19,  2.45s/it]
 85%|████████▌ | 41/48 [01:53<00:17,  2.49s/it]
 88%|████████▊ | 42/48 [01:55<00:14,  2.37s/it]
 90%|████████▉ | 43/48 [01:55<00:08,  1.78s/it]
 92%|█████████▏| 44/48 [02:02<00:13,  3.38s/it]
 94%|█████████▍| 45/48 [02:05<00:09,  3.23s/it]
 96%|█████████▌| 46/48 [02:06<00:04,  2.35s/it]
 98%|█████████▊| 47/48 [02:06<00:01,  1.75s/it]
100%|██████████| 48/48 [02:08<00:00,  1.74s/it]
100%|██████████| 48/48 [02:08<00:00,  2.67s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     48        
Failed requests:                         0         
Maximum request concurrency:             4         
Benchmark duration (s):                  128.18    
Total input tokens:                      786926    
Total generated tokens:                  356       
Request throughput (req/s):              0.37      
Output token throughput (tok/s):         2.78      
Peak output token throughput (tok/s):    12.00     
Peak concurrent requests:                7.00      
Total token throughput (tok/s):          6141.81   
---------------Time to First Token----------------
Mean TTFT (ms):                          4917.22   
Median TTFT (ms):                        4760.30   
P50 TTFT (ms):                           4760.30   
P90 TTFT (ms):                           6546.28   
P99 TTFT (ms):                           8134.83   
==================================================